In [1]:
import pandas as pd

In [2]:
import pandas as pd
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }
df1=pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

### 1.Display Top 3 Rows of The Dataset

In [3]:
df1.head(2)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female

### 2. Check Last 3 Rows of The Dataset

In [4]:
df1.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

### 3. Find Shape of Our Dataset (Number of Rows & Number of Columns)

In [5]:
df1.shape

(7, 3)

In [6]:
print("Number of Rows",df1.shape[0])
print("Number of Columns",df1.shape[1])

Number of Rows 7
Number of Columns 3

### 4. Get Information About Our Dataset Like Total Number Rows, Total Number of Columns, Datatypes of Each Column And Memory Requirement

In [7]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

### 5.Check Null Values In The Dataset

In [8]:
 df1.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

### 6. Get Overall Statistics About The Dataframe

In [9]:
df1.describe(include='all')

          Name      Marks  Gender
count        7   7.000000       7
unique       7        NaN       2
top     Krisha        NaN  Female
freq         1        NaN       4
mean       NaN  92.142857     NaN
std        NaN   6.491753     NaN
min        NaN  83.000000     NaN
25%        NaN  88.000000     NaN
50%        NaN  90.000000     NaN
75%        NaN  98.500000     NaN
max        NaN  99.000000     NaN

### 7.Find Unique Values From The Gender Column

In [10]:
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

### 8. Find the Number of Unique values from the Gender column

In [11]:
len(df1['Gender'].unique())

2

In [12]:
df1['Gender'].nunique()

2

### 9. Display Count of Unique Values In Gender Column

In [13]:
df1['Gender'].value_counts()

Female    4
Male      3
Name: Gender, dtype: int64

### 10. Find Total Number of Students Having Marks Between 90 To 100 (Inclusive) Using Between Method

In [14]:

df1[df1['Marks']>=90]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [15]:

df1[(df1['Marks']>=90) & (df1['Marks']<=100)]['Name']

0    Priyang
2     Krisha
4     Parshv
6    Archana
Name: Name, dtype: object

In [16]:

sum((df1['Marks']>=90) & (df1['Marks']<=100))

4

In [17]:
sum(df1['Marks'].between(90,100))

4

### 11. Find Average Marks

In [18]:

df1['Marks'].mean()

92.14285714285714

### 12. Apply Method

In [ ]:
df1

In [ ]:
def marks(x):
    return x/2

In [ ]:
df1['Half_Marks']=df1['Marks'].apply(marks)

In [ ]:
df1

In [ ]:

df1['Name'].apply(len)

In [ ]:
df1['Marks'].apply(lambda x:x//2)

In [ ]:
df1

### 13. Map Function

In [ ]:
df1['Male_Female']=df1['Gender'].map({'Male':1,'Female':0})

In [ ]:
df1

### 14. Drop the Column(s)

In [ ]:
df1

In [ ]:

df1.drop(['Male_Female','Half_Marks'],axis=1)

In [ ]:
df1

### 15. Print Name of the Columns

In [ ]:
df1.columns

In [ ]:
df1.index

### 16. Sort The Dataframe As Per The Marks Column

In [ ]:

df1.sort_values(by='Marks',ascending=False)

### 17. Display Name & Marks of The Female Students

In [ ]:
df1[df1['Gender']=='Female'][['Name','Marks']]

In [ ]:

df1[df1['Gender'].str.contains('female',case=False)][['Name','Marks']]

In [ ]:
df1[df1['Gender'].isin(['Female'])][['Name','Marks']]